ELSPL/STM32F4-Dev/Example Projects/Camera/Eg1/Src/main.c
/******************************************************************//**
* @file   main.c
* @brief  Write a program to demonstrate camera function
* @version  v1.0
* @date   Apr 16, 2015
* @author Bhavin R. Darji
**********************************************************************/


/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"
#include "gpio.h"

/* USER CODE BEGIN Includes */
#include "stm32f4_global.h"
#include "stm32f4_discovery_uart.h"
//#include "stm32f4_discovery_vcp.h"
//#include "stm32f4_discovery.h"
//#include "stm32f4_ask25.h"
#include "stm32f4_discovery_camera.h"
#include "stm32f4_discovery_lcd.h"


/* USER CODE END Includes */

/* Private variables ---------------------------------------------------------*/

/* USER CODE BEGIN PV */

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);

/* USER CODE BEGIN PFP */

/* USER CODE END PFP */

/* USER CODE BEGIN 0 */

/* USER CODE END 0 */

int main(void)
{

  /* USER CODE BEGIN 1 */
  trace_printf("Hello\n");
  uint8_t data, contrast = 50;
  uint8_t brightness = 50, mirror = 0, flip = 0;

  /* USER CODE END 1 */

  /* MCU Configuration----------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* Configure the system clock */
  SystemClock_Config();

  /* Initialize all configured peripherals */
  MX_GPIO_Init();

  /* USER CODE BEGIN 2 */

  /* Initialize VCP */
  BSP_VCP_Init();
  vgetche(BLOCKING);  // To initialize VCP


  vuprintf("Camera Functions\n\r");
  vuprintf("1. CAMERA Suspend\n\r");
  vuprintf("2. CAMERA Resume\n\r");
  vuprintf("3. Contrast Increase\n\r");
  vuprintf("4. Contrast Decrease\n\r");
  vuprintf("5 .Brightness Increase\n\r");
  vuprintf("6. Brightness Decrease\n\r");
  vuprintf("7  Mirror Image\n\r");
  vuprintf("8. Flip Image\n\r");

  /* Initialize LCD Display */
  BSP_LCD_Init();
  BSP_LCD_Clear(White);

  /* Initialize Camera */
  BSP_CAMERA_Init(RESOLUTION_R320x240);
  BSP_CAMERA_ContinuousStart((uint8_t *)LCD_BASE_DATA);
  BSP_CAMERA_ContrastBrightnessConfig(50,50);
  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  while (1)
  {
  /* USER CODE END WHILE */

  /* USER CODE BEGIN 3 */

    data = vgetche(BLOCKING);
    switch (data)
    {
      case '1':
        BSP_CAMERA_Suspend();
        break;
      case '2':
        BSP_CAMERA_Resume();
        break;
      case '3':
        contrast += 10;
        BSP_CAMERA_ContrastBrightnessConfig(contrast,brightness);
        break;
      case '4':
        contrast -= 10;
        BSP_CAMERA_ContrastBrightnessConfig(contrast,brightness);
        break;
      case '5':
        brightness += 10;
        BSP_CAMERA_ContrastBrightnessConfig(contrast,brightness);
        break;
      case '6':
        brightness -= 10;
        BSP_CAMERA_ContrastBrightnessConfig(contrast,brightness);
        break;
      case '7':
        if(mirror)
        {
          mirror = 0;
          BSP_CAMERA_MirrorFlipConfig(mirror,flip);
          break;
        }
        mirror = 1;
        BSP_CAMERA_MirrorFlipConfig(mirror,flip);
        break;
      case '8':
        if(flip)
        {
          flip = 0;
          BSP_CAMERA_MirrorFlipConfig(mirror,flip);
          break;
        }
        flip = 1;
        BSP_CAMERA_MirrorFlipConfig(mirror,flip);
        break;
      default:

        break;
    }
  }
  /* USER CODE END 3 */

}

/** System Clock Configuration
*/
void SystemClock_Config(void)
{
  RCC_OscInitTypeDef RCC_OscInitStruct;
  RCC_ClkInitTypeDef RCC_ClkInitStruct;

  __PWR_CLK_ENABLE();

  __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE1);

  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE;
  RCC_OscInitStruct.HSEState = RCC_HSE_ON;
//  RCC_OscInitStruct.OscillatorType |= RCC_OSCILLATORTYPE_LSI;  // uncomment when LSI clock is used for RTC
//  RCC_OscInitStruct.LSIState = RCC_LSI_ON;        // uncomment when LSI Clock is used for RTC
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
  RCC_OscInitStruct.PLL.PLLM = 8;
  RCC_OscInitStruct.PLL.PLLN = 336;
  RCC_OscInitStruct.PLL.PLLP = RCC_PLLP_DIV2;
  RCC_OscInitStruct.PLL.PLLQ = 7;
  HAL_RCC_OscConfig(&RCC_OscInitStruct);

  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_SYSCLK|RCC_CLOCKTYPE_PCLK1
                              |RCC_CLOCKTYPE_PCLK2;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV4;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV2;
  HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_5);

#ifdef USE_STM32F4_RTC
  RCC_PeriphCLKInitTypeDef PeriphClkInitStruct;
  PeriphClkInitStruct.PeriphClockSelection = RCC_PERIPHCLK_RTC;
  PeriphClkInitStruct.RTCClockSelection = RCC_RTCCLKSOURCE_HSE_DIV8;  // Comment this line if you want to use LSI clock
//  PeriphClkInitStruct.RTCClockSelection = RCC_RTCCLKSOURCE_LSI;     // Remove comment if you want to use LSI clock
  HAL_RCCEx_PeriphCLKConfig(&PeriphClkInitStruct);
#endif /* USE_STM32F4_RTC */

#ifdef USE_STM32F4_TSC
  /* Enable the CRC Module */
  __HAL_RCC_CRC_CLK_ENABLE();
#endif
}

/* USER CODE BEGIN 4 */

/* USER CODE END 4 */

#ifdef USE_FULL_ASSERT

/**
   * @brief Reports the name of the source file and the source line number
   * where the assert_param error has occurred.
   * @param file: pointer to the source file name
   * @param line: assert_param error line source number
   * @retval None
   */
void assert_failed(uint8_t* file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
    ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */

}

#endif

/**
  * @}
  */

/**
  * @}
*/

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
